Tekla.Structures.DrawingInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.DrawingInternal.DelegateProxy.#cctor
Initializes static members of the Tekla.Structures.DrawingInternal.DelegateProxy class.
Thrown if Tekla Structures is not running

Tekla.Structures.DrawingInternal.DelegateProxy.Initialize
Initializes the delegate proxy,

Tekla.Structures.DrawingInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.DrawingInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: